In [2]:
import pandas as pd 
l1=pd.Series(['Adit','Sakshi','Pranu','Shruti'])
l2=pd.Series(['phy','chem','maths','Ip'])
l3=pd.Series([4,3,7,8])
l4=pd.Series([44,65,45])
l5=pd.Series([32,43,32,53])
d1={'Name':l1,'Sub':l2,'Roll_no':l3,'M1':l4,'M2':l5}
a=pd.DataFrame(d1)
a.index=[1,2,3,4]
a.columns.name='Data'
a.index.name='Values'
a

Data      Name    Sub  Roll_no    M1  M2
Values
1         Adit    phy        4  44.0  32
2       Sakshi   chem        3  65.0  43
3        Pranu  maths        7  45.0  32
4       Shruti     Ip        8   NaN  53

In [4]:
a.to_csv('Sample.csv')

In [3]:
a.head(2)

Data      Name   Sub  Roll_no    M1  M2
Values
1         Adit   phy        4  44.0  32
2       Sakshi  chem        3  65.0  43

In [4]:
a.tail(2)

Data      Name    Sub  Roll_no    M1  M2
Values
3        Pranu  maths        7  45.0  32
4       Shruti     Ip        8   NaN  53

In [5]:
a.describe()

Data    Roll_no         M1         M2
count  4.000000   3.000000   4.000000
mean   5.500000  51.333333  40.000000
std    2.380476  11.846237  10.099505
min    3.000000  44.000000  32.000000
25%    3.750000  44.500000  32.000000
50%    5.500000  45.000000  37.500000
75%    7.250000  55.000000  45.500000
max    8.000000  65.000000  53.000000

In [6]:
a.count()

Data
Name       4
Sub        4
Roll_no    4
M1         3
M2         4
dtype: int64

In [7]:
a.size

20

In [8]:
a.T

Values      1       2      3       4
Data
Name     Adit  Sakshi  Pranu  Shruti
Sub       phy    chem  maths      Ip
Roll_no     4       3      7       8
M1       44.0    65.0   45.0     NaN
M2         32      43     32      53

In [9]:
a.shape

(4, 5)

In [10]:
a.loc[3]

Data
Name       Pranu
Sub        maths
Roll_no        7
M1          45.0
M2            32
Name: 3, dtype: object

In [11]:
a.iloc[3]

Data
Name       Shruti
Sub            Ip
Roll_no         8
M1            NaN
M2             53
Name: 4, dtype: object

In [12]:
a['Sub']

Values
1      phy
2     chem
3    maths
4       Ip
Name: Sub, dtype: object

In [13]:
a[['M1','M2']]

Data      M1  M2
Values
1       44.0  32
2       65.0  43
3       45.0  32
4        NaN  53

In [14]:
a.loc[2:4]

Data      Name    Sub  Roll_no    M1  M2
Values
2       Sakshi   chem        3  65.0  43
3        Pranu  maths        7  45.0  32
4       Shruti     Ip        8   NaN  53

In [6]:
a.iloc[2:4]

Data      Name    Sub  Roll_no    M1  M2
Values
3        Pranu  maths        7  45.0  32
4       Shruti     Ip        8   NaN  53

ILOC bascially not slice till the last index told but stops just before it
LOC slice till the last index told to do so

In [16]:
a[2:4]

Data      Name    Sub  Roll_no    M1  M2
Values
3        Pranu  maths        7  45.0  32
4       Shruti     Ip        8   NaN  53

In [17]:
a.loc[2:4,'Sub':'M2']

Data      Sub  Roll_no    M1  M2
Values
2        chem        3  65.0  43
3       maths        7  45.0  32
4          Ip        8   NaN  53

In [18]:
a.sort_values(ascending=True,by='M2') # Sorting done according to m2

Data      Name    Sub  Roll_no    M1  M2
Values
1         Adit    phy        4  44.0  32
3        Pranu  maths        7  45.0  32
2       Sakshi   chem        3  65.0  43
4       Shruti     Ip        8   NaN  53

In [19]:
a.index

Index([1, 2, 3, 4], dtype='int64', name='Values')

In [20]:
a.columns

Index(['Name', 'Sub', 'Roll_no', 'M1', 'M2'], dtype='object', name='Data')

In [21]:
a.axes

[Index([1, 2, 3, 4], dtype='int64', name='Values'),
 Index(['Name', 'Sub', 'Roll_no', 'M1', 'M2'], dtype='object', name='Data')]

In [22]:
a.max()

Data
Name       Shruti
Sub           phy
Roll_no         8
M1           65.0
M2             53
dtype: object

In [24]:
a.min()

Data
Name       Adit
Sub          Ip
Roll_no       3
M1         44.0
M2           32
dtype: object

In [30]:
a['M3']=[22,65,33,87] # Insert a new column
a

Data      Name    Sub  Roll_no    M1  M2  M3
Values
1         Adit    phy        4  44.0  32  22
2       Sakshi   chem        3  65.0  43  65
3        Pranu  maths        7  45.0  32  33
4       Shruti     Ip        8   NaN  53  87

In [31]:
a.insert(2,'City',['Delhi','London','Ranchi','Mumbai']) # Insert a new column at a certain position
a

Data      Name    Sub    City  Roll_no    M1  M2  M3
Values
1         Adit    phy   Delhi        4  44.0  32  22
2       Sakshi   chem  London        3  65.0  43  65
3        Pranu  maths  Ranchi        7  45.0  32  33
4       Shruti     Ip  Mumbai        8   NaN  53  87

In [32]:
a.drop(2)

Data      Name    Sub    City  Roll_no    M1  M2  M3
Values
1         Adit    phy   Delhi        4  44.0  32  22
3        Pranu  maths  Ranchi        7  45.0  32  33
4       Shruti     Ip  Mumbai        8   NaN  53  87

In [33]:
a.loc[a['M3']>=85]

Data      Name Sub    City  Roll_no  M1  M2  M3
Values
4       Shruti  Ip  Mumbai        8 NaN  53  87

In [34]:
a['M2'].mode()

0    32
Name: M2, dtype: int64

In [35]:
a.sum()

Data
Name         AditSakshiPranuShruti
Sub                 phychemmathsIp
City       DelhiLondonRanchiMumbai
Roll_no                         22
M1                           154.0
M2                             160
M3                             207
dtype: object

In [36]:
import pandas as pd
l1=pd.Series(['Adit','Sakshi','Pranu','Shruti'])
l2=pd.Series(['phy','chem','maths','Ip'])
l3=pd.Series([4,3,7,8])
d1={'Name':l1,'Sub':l2,'Roll_no':l3}
a=pd.DataFrame(d1)
a.loc[a['Roll_no']>=5]

     Name    Sub  Roll_no
2   Pranu  maths        7
3  Shruti     Ip        8

In [38]:
import pandas as pd
l1=pd.Series(['Adit','Sakshi','Pranu','Shruti'])
l2=pd.Series(['phy','chem','maths','Ip'])
l3=pd.Series([4,3,7,8])
d1={'Name':l1,'Sub':l2,'Roll_no':l3}
a=pd.DataFrame(d1)
a.loc[a['Roll_no']==7]

    Name    Sub  Roll_no
2  Pranu  maths        7